app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(title: params[:school_class][:title], room_number: params[:school_class][:room_number])

    if @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "atsd"], ["room_number", 2], ["created_at", "2020-12-16 22:12:21.610148"], ["updated_at", "2020-12-16 22:12:21.610148"]]